#Область СтандартныеПеременныеИФункции
Перем ОбработкаВыполненаУспешно Экспорт;
Перем ОписаниеОшибки Экспорт;
Перем ВходящиеДанные Экспорт;
Перем ПараметрыЗапроса Экспорт;
Перем ЗаголовкиЗапроса Экспорт;
Перем ПараметрыУРЛ Экспорт;
#КонецОбласти

Функция ВыполнитьОбработкуПриложения() Экспорт
	Если ПараметрыЗапроса.Свойство("action") Тогда
		Если ПараметрыЗапроса.action = "nomenclature" Тогда
			//•	Получить регистрационные данные компании
			ВозвращаемыеДанные = ПолучитьДанныеОНоменклатуре();
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВозвращаемыеДанные;
КонецФункции

#Область ПользовательскиеФункции
Функция ПолучитьДанныеОНоменклатуре()
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать * Из Справочник.Номенклатура";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ВозвращаемыеДанные = Новый Массив;
	СтруктураСтроки = "Номенклатура, Количество";
	Пока Выборка.Следующий() Цикл
		ВозвращаемыеДанные.Добавить(Новый Структура(СтруктураСтроки, Выборка.Наименование, Выборка.Количество));
	КонецЦикла;
	
	Возврат ВозвращаемыеДанные;
КонецФункции
#КонецОбласти

ОбработкаВыполненаУспешно = Истина;
ОписаниеОшибки = "";