// liteExchange
&НаСервере
Процедура ВыгрузитьНаСервере()
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("Источник", Объект.СсылкаНаОбъект);
	стрПараметры.Вставить("Приложение", "Обмен Тест");
	леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	Настройки = леПодключаемыеОбработчики.ПолучитьНастройки();
	Пока Настройки.Следующий() Цикл
		Файлы = НайтиФайлы(Настройки.КаталогОбмена, "le*");
		
		СписокФайлов = Новый СписокЗначений;
		
		Для Каждого Файл Из Файлы Цикл
			СписокФайлов.Добавить(Файл.ПолноеИмя);	
		КонецЦикла;
		
		СписокФайлов.СортироватьПоЗначению(НаправлениеСортировки.Возр);
		Для Каждого Файл из СписокФайлов Цикл
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(Файл.Значение);	
			Данные = леРаботаСJSON.ДанныеИзJSON(ТекстовыйДокумент.ПолучитьТекст());
			Для Каждого Элемент Из Данные Цикл
				леРаботаСJSON.ВосстановитьОбъект1сИзСтруктуры(Элемент);
			КонецЦикла;
			УдалитьФайлы(Файл.Значение);
		КонецЦикла;
	КонецЦикла;		
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПрефиксацияСправочниковНаСервере()
	Префикс = Константы.ПрефиксУзлаРаспределеннойИнформационнойБазы.Получить();
	
	ШаблонЗапроса = 
		"ВЫБРАТЬ
		|	Таблица.Ссылка КАК Ссылка,
		|	Таблица.Код КАК Код
		|ИЗ
		|	Справочник.%ИмяТаблицы% КАК Таблица";	
	
	МассивСправочников = Новый Массив;
	МассивСправочников.Добавить("Контрагенты");
	МассивСправочников.Добавить("Номенклатура");
	МассивСправочников.Добавить("ФизическиеЛица");
	МассивСправочников.Добавить("ОбъектыСтроительства");
	МассивСправочников.Добавить("НомераГТД");
	МассивСправочников.Добавить("ТранспортныеСредства");
	МассивСправочников.Добавить("ДоговорыКонтрагентов");
	МассивСправочников.Добавить("ПодразделенияОрганизаций");
	МассивСправочников.Добавить("Патенты");
	МассивСправочников.Добавить("СпособыОтраженияРасходовПоАмортизации");
	МассивСправочников.Добавить("Организации");	
		
	Для Каждого метаСправочник из МассивСправочников Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = СтрЗаменить(ШаблонЗапроса, "%ИмяТаблицы%", метаСправочник);
				
		Попытка
			РезультатЗапроса = Запрос.Выполнить();	
			Выборка = РезультатЗапроса.Выбрать();	
			
			Пока Выборка.Следующий() Цикл
				Справочник = Выборка.Ссылка.ПолучитьОбъект();
				КодСтарый = Сред(Справочник.Код, 3); 
				Справочник.Код = Префикс+КодСтарый;
				Справочник.ОбменДанными.Загрузка = Истина;
				Справочник.Записать();
			КонецЦикла;
		Исключение
		КонецПопытки
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ПрефиксацияСправочников(Команда)
	Режим = РежимДиалогаВопрос.ДаНетОтмена;
    Ответ = Вопрос("Данная команда установит префикс этой ИБ на все элементы всех справочников, это может занять продолжительное время. Продолжить?", Режим, 0);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПрефиксацияСправочниковНаСервере();
	ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
		Сообщить("Префиксация справочников отменена");
	КонецЕсли; 
КонецПроцедуры

//Форма
&НаКлиенте
Процедура ПоступленияАктыНакладные(Команда)
	ПоступленияАктыНакладныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.НачалоПериода = НачалоДня(ТекущаяДата());
	Объект.КонецПериода  = КонецДня(ТекущаяДата());
КонецПроцедуры

//Справочники

&НаСервере
Процедура ВидыНоменклатурыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыНоменклатуры КАК ВидыНоменклатуры
		|ГДЕ
		|	ВидыНоменклатуры.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидыНоменклатуры(Команда)
	ВидыНоменклатурыНаСервере();
КонецПроцедуры


&НаСервере
Процедура БанковскиеСчетаНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БанковскиеСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.БанковскиеСчета КАК БанковскиеСчета
		|ГДЕ
		|	БанковскиеСчета.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура БанковскиеСчета(Команда)
	БанковскиеСчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Валюты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Валюты КАК Валюты
		|ГДЕ
		|	Валюты.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Валюты(Команда)
	ВалютыНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Контрагенты(Команда)
	КонтрагентыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФизическиеЛицаНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФизическиеЛица.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ФизическиеЛица(Команда)
	ФизическиеЛицаНаСервере();
КонецПроцедуры

&НаСервере
Процедура СкладыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Склады.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Склады(Команда)
	СкладыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатьиЗатратНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиЗатрат.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатьиЗатрат КАК СтатьиЗатрат
		|ГДЕ
		|	СтатьиЗатрат.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура БилетыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Билеты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Билеты КАК Билеты
		|ГДЕ
		|	Билеты.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Билеты(Команда)
	БилетыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидыНалоговИПлатежейВБюлжетНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыНалоговИПлатежейВБюджет.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыНалоговИПлатежейВБюджет КАК ВидыНалоговИПлатежейВБюджет
		|ГДЕ
		|	ВидыНалоговИПлатежейВБюджет.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидыНалоговИПлатежейВБюлжет(Команда)
	ВидыНалоговИПлатежейВБюлжетНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТиповыеОперацииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТиповыеОперации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТиповыеОперации КАК ТиповыеОперации
		|ГДЕ
		|	ТиповыеОперации.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТиповыеОперации(Команда)
	ТиповыеОперацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЕденицыИзмеренияНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторЕдиницИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
		|ГДЕ
		|	КлассификаторЕдиницИзмерения.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЕденицыИзмерения(Команда)
	ЕденицыИзмеренияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбъектыСтроительстваНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОбъектыСтроительства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства
		|ГДЕ
		|	ОбъектыСтроительства.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыСтроительства(Команда)
	ОбъектыСтроительстваНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтраныМираНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтраныМира.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтраныМира КАК СтраныМира
		|ГДЕ
		|	СтраныМира.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СтраныМира(Команда)
	СтраныМираНаСервере();
КонецПроцедуры

&НаСервере
Процедура НомераГТДНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НомераГТД.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НомераГТД КАК НомераГТД
		|ГДЕ
		|	НомераГТД.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НомераГТД(Команда)
	НомераГТДНаСервере();
КонецПроцедуры

&НаСервере
Процедура ШтрихКодыУпаковокТоваровНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ШтрихКодыУпаковокТоваров(Команда)
	ШтрихКодыУпаковокТоваровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТранспортныеСредстваНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТранспортныеСредства.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТранспортныеСредства КАК ТранспортныеСредства
		|ГДЕ
		|	ТранспортныеСредства.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТранспортныеСредства(Команда)
	ТранспортныеСредстваНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидыВзаиморасчетовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВидыВзаиморасчетов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыВзаиморасчетов КАК ВидыВзаиморасчетов
		|ГДЕ
		|	ВидыВзаиморасчетов.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВидыВзаиморасчетов(Команда)
	ВидыВзаиморасчетовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПользователиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	Пользователи.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Пользователи(Команда)
	ПользователиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорыКонтрагентовНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыКонтрагентов(Команда)
	ДоговорыКонтрагентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТипыЦенНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТипыЦенНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
		|ГДЕ
		|	ТипыЦенНоменклатуры.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТипыЦен(Команда)
	ТипыЦенНаСервере();
КонецПроцедуры

&НаСервере
Процедура РегистрацияВНалоговыхОрганахНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
		|ГДЕ
		|	РегистрацииВНалоговомОргане.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВНалоговыхОрганах(Команда)
	РегистрацияВНалоговыхОрганахНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодразделенияОрганизацииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодразделенияОрганизаций.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ПодразделенияОрганизаций КАК ПодразделенияОрганизаций
		|ГДЕ
		|	ПодразделенияОрганизаций.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияОрганизации(Команда)
	ПодразделенияОрганизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпособыОтраженияРасходовПоАмортизацииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпособыОтраженияРасходовПоАмортизации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СпособыОтраженияРасходовПоАмортизации КАК СпособыОтраженияРасходовПоАмортизации
		|ГДЕ
		|	СпособыОтраженияРасходовПоАмортизации.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СпособыОтраженияРасходовПоАмортизации(Команда)
	СпособыОтраженияРасходовПоАмортизацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПатентыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Патенты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Патенты КАК Патенты
		|ГДЕ
		|	Патенты.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Патенты(Команда)
	ПатентыНаСервере();
КонецПроцедуры

&НаСервере
Процедура НоменклатураНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура(Команда)
	НоменклатураНаСервере();
КонецПроцедуры

&НаСервере
Процедура БанкиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Банки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	Банки.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Банки(Команда)
	БанкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	День = Объект.НачалоПериода;
	Объект.НачалоПериода = НачалоДня(День);
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	День = Объект.КонецПериода;
	Объект.КонецПериода = КонецДня(День);
КонецПроцедуры

&НаСервере
Процедура ОрганизацииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Организации(Команда)
	ОрганизацииНаСервере();
КонецПроцедуры


//Документы
&НаСервере
Процедура ПоступленияАктыНакладныеНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	ПоступлениеТоваровУслуг.ПометкаУдаления = &ПометкаУдаления
		|	И ПоступлениеТоваровУслуг.Дата >= &ДатаС
		|	И ПоступлениеТоваровУслуг.Дата <= &ДатаПо";
	Запрос.УстановитьПараметр("ДатаС", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры


&НаСервере
Процедура ОказаниеУслугНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОказаниеУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ОказаниеУслуг КАК ОказаниеУслуг
		|ГДЕ
		|	ОказаниеУслуг.ПометкаУдаления = &ПометкаУдаления
		|	И ОказаниеУслуг.Номер >= &ДатаС
		|	И ОказаниеУслуг.Номер <= &ДатаПо";
	Запрос.УстановитьПараметр("ДатаС", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ОказаниеУслуг(Команда)
	ОказаниеУслугНаСервере();
КонецПроцедуры


&НаСервере
Процедура АвансовыйОтчетНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АвансовыйОтчет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|ГДЕ
		|	АвансовыйОтчет.ПометкаУдаления = &ПометкаУдаления
		|	И АвансовыйОтчет.Дата >= &ДатаС
		|	И АвансовыйОтчет.Дата <= &ДатаПо";
	Запрос.УстановитьПараметр("ДатаС", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура АвансовыйОтчет(Команда)
	АвансовыйОтчетНаСервере();
КонецПроцедуры


&НаСервере
Процедура СписаниеСРСНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СписаниеСРасчетногоСчета.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.СписаниеСРасчетногоСчета КАК СписаниеСРасчетногоСчета
		|ГДЕ
		|	СписаниеСРасчетногоСчета.ПометкаУдаления = &ПометкаУдаления
		|	И СписаниеСРасчетногоСчета.Дата >= &ДатаС
		|	И СписаниеСРасчетногоСчета.Дата <= &ДатаПо";
	Запрос.УстановитьПараметр("ДатаС", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СписаниеСРС(Команда)
	СписаниеСРСНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПоступлениеНаРСНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
		|ГДЕ
		|	ПоступлениеНаРасчетныйСчет.Ссылка = &Ссылка
		|	И ПоступлениеНаРасчетныйСчет.Дата >= &ДатаС
		|	И ПоступлениеНаРасчетныйСчет.Дата <= &ДатаПо";
	Запрос.УстановитьПараметр("ДатаС", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ПоступлениеНаРС(Команда)
	ПоступлениеНаРСНаСервере();
КонецПроцедуры

&НаСервере
Процедура СтатьиДДСНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатьиДвиженияДенежныхСредств.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.СтатьиДвиженияДенежныхСредств КАК СтатьиДвиженияДенежныхСредств
		|ГДЕ
		|	СтатьиДвиженияДенежныхСредств.ПометкаУдаления = &ПометкаУдаления";
	Запрос.УстановитьПараметр("ПометкаУдаления", Ложь);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	//МассивЭлементов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		стрПараметры = Новый Структура;
		стрПараметры.Вставить("Источник", Выборка.Ссылка);
		стрПараметры.Вставить("Приложение", "Обмен Тест");
		//МассивЭлементов.Добавить(стрПараметры);	
		леПодключаемыеОбработчики.ВыполнитьПодключаемыйОбработчикВФоне(стрПараметры);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДДС(Команда)
	СтатьиДДСНаСервере();
КонецПроцедуры



