// входящие данные
Перем Адрес    Экспорт;
Перем Данные   Экспорт;
Перем JSON     Экспорт;
Перем Файлы    Экспорт;
Перем Объект1с Экспорт;
Перем Таймаут  Экспорт;
Перем ФорматОтвета  Экспорт;
Перем Cookies       Экспорт;
Перем Сессия        Экспорт;
Перем Заголовки     Экспорт;

Перем РазрешитьПеренаправление Экспорт;
Перем ПроверятьSSL             Экспорт;
Перем КлиентскийСертификатSSL  Экспорт;
Перем Прокси                   Экспорт;
	
// Исходящие данные
Перем КодОтвета         Экспорт;
Перем СообщениеОбОшибке Экспорт;
Перем ОтветСервера      Экспорт;

#Область ПрограммныйИнтерфейс

Функция POST(Адрес = Неопределено, ДанныеВJSON = Неопределено, Логин = Неопределено, Пароль = Неопределено)
	
КонецФункции

Функция Get()
	
КонецФункции

#КонецОбласти

#Область ВыполнениеЗапросов

#КонецОбласти

#Область ОбработкаОтветов

#КонецОбласти

#Область Служебные

#КонецОбласти