Процедура СообщитьОбОшибке(Сообщение, ИмяСобытия = Неопределено) Экспорт
	Если ИмяСобытия = Неопределено Тогда
		ИмяСобытия = ИмяСобытияПоУмолчанию();
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,,Сообщение);
КонецПроцедуры

Процедура СообщитьИнформацию(Сообщение, ИмяСобытия = Неопределено) Экспорт
	Если ИмяСобытия = Неопределено Тогда
		ИмяСобытия = ИмяСобытияПоУмолчанию();
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Информация,,,Сообщение);
КонецПроцедуры

Функция ИмяСобытияОбмен() Экспорт
	Возврат "Exchange API";
КонецФункции

Функция ИмяСобытияПоУмолчанию() Экспорт
	Возврат "liteExchange";
КонецФункции