#Область ПеременныеМодуля
Перем КодОтвета;
Перем ЗаголовкиОтвета;
Перем ТелоОтвета;
Перем ФорматТелаОтвета;

Перем ВозвращаемыеДанные;

Перем ВходящиеДанные;
Перем ПараметрыЗапроса;
Перем ЗаголовкиЗапроса;
Перем ПараметрыУРЛ;
#КонецОбласти

#Область ОсновныеПроцедуры
Функция ВыполнитьПриложение(СервисЗапрос, Метод) Экспорт
	
	Ответ = Новый HTTPСервисОтвет(500,,ЗаголовкиОтвета);
	Ответ.УстановитьТелоИзСтроки("Ошибка установки приложения liteExchange или попытка нелицензированного использования", КодировкаТекста.UTF8);	
	
	Возврат Ответ;
	
КонецФункции
#КонецОбласти

#Область Инициализация
КодОтвета = 200;
ЗаголовкиОтвета = Новый Соответствие;
ЗаголовкиОтвета.Вставить("Charset", "utf-8");
ЗаголовкиОтвета.Вставить("Content-type", "application/JSON");

ТекстОноРаботает = "Что-то уже работает!";
ТелоОтвета = "{""data"":"+ТекстОноРаботает+"}";

ФорматТелаОтвета = "JSON";

ВозвращаемыеДанные = ТекстОноРаботает;

ПараметрыУРЛ = Новый Структура;
ПараметрыЗапроса = Новый Структура;
#КонецОбласти